In [1]:
import pandas as pd

data = pd.read_csv("student_marks.csv")
data

,Student ID,Name,Tamil,English,Maths,Science,Social Science,Total,Grade
0,1,Raghavan,98,96,99,97,95,485,A
1,2,Mythili,97,99,95,98,96,485,A
2,3,Sridhar,96,95,98,99,97,485,A
3,4,Janani,99,97,96,95,98,485,A
4,5,Kannan,95,98,97,96,99,485,A
...,...,...,...,...,...,...,...,...,...
95,96,Thenral,45,65,72,55,70,307,D
96,97,Surya,62,70,55,68,48,303,D
97,98,Malar,72,52,68,62,55,309,D
98,99,Vivek,55,68,48,75,65,311,D
99,100,Poornima,68,48,70,52,75,313,D

In [3]:
print(data.loc[[0]])

   Student ID      Name  Tamil  English  Maths  Science  Social Science  \
0           1  Raghavan     98       96     99       97              95

   Total Grade
0    485     A

In [9]:
print(data.loc[[2,64]])

    Student ID            Name  Tamil  English  Maths  Science  \
2            3         Sridhar     96       95     98       99
64          65  Gopalakrishnan     76       80     86       94

    Social Science  Total Grade
2               97    485     A
64              79    415     C

In [11]:
print(data.iloc[[1]])

   Student ID     Name  Tamil  English  Maths  Science  Social Science  Total  \
1           2  Mythili     97       99     95       98              96    485

  Grade
1     A

In [17]:
import pandas as pd

student = {"name":["arun","bala","chandru"],
           "physics":[87,90,89],
           "chemistry":[85,79,95],
           "maths":[90,95,80]}
df = pd.DataFrame(student)
df

      name  physics  chemistry  maths
0     arun       87         85     90
1     bala       90         79     95
2  chandru       89         95     80

In [21]:
print(df.loc[2])

name         chandru
physics           89
chemistry         95
maths             80
Name: 2, dtype: object

In [23]:
df["chemistry"]

0    85
1    79
2    95
Name: chemistry, dtype: int64

In [25]:
data = {'Name': ['Alice', 'Bob', 'Charlie'], 
        'Age': [25, 30, 35], 
        'Score': [85, 90, 95]}
df = pd.DataFrame(data, index=['a', 'b', 'c'])
print(df)

      Name  Age  Score
a    Alice   25     85
b      Bob   30     90
c  Charlie   35     95